In [1]:
import numpy as np
import pandas as pd

In [2]:
heighs = pd.Series([1.78,1.90,1.87,1.76,.78])

In [3]:
heighs

0    1.78
1    1.90
2    1.87
3    1.76
4    0.78
dtype: float64

In [5]:
heighs[4]

0.78

In [6]:
heighs[0:3]

0    1.78
1    1.90
2    1.87
dtype: float64

In [7]:
heighs = np.array([1.78,1.90,1.87,1.76,.78])

In [8]:
type(heighs)

numpy.ndarray

In [9]:
h = pd.Series(heighs)

In [10]:
type(h)

pandas.core.series.Series

In [11]:
h

0    1.78
1    1.90
2    1.87
3    1.76
4    0.78
dtype: float64

In [12]:
h.head(3)

0    1.78
1    1.90
2    1.87
dtype: float64

In [13]:
h.tail(2)

3    1.76
4    0.78
dtype: float64

In [14]:
# tao series la cac diem trung binh cua cac hoc sinh
my_dic = {'std001':8.9, 'std002':7.5, 'std003':6.7, 'std004':7.5}

In [15]:
my_ser = pd.Series(my_dic)

In [16]:
my_ser

std001    8.9
std002    7.5
std003    6.7
std004    7.5
dtype: float64

In [17]:
my_ser['std003']

6.7

In [18]:
my_ser[2]

6.7

In [19]:
my_ser['std003'] = 7.6

In [20]:
my_ser

std001    8.9
std002    7.5
std003    7.6
std004    7.5
dtype: float64

In [21]:
my_ser['std005'] = 6.5

In [22]:
my_ser

std001    8.9
std002    7.5
std003    7.6
std004    7.5
std005    6.5
dtype: float64

In [23]:
my_ser.shape

(5,)

In [24]:
my_ser.shape[0]

5

In [25]:
my_ser.head()

std001    8.9
std002    7.5
std003    7.6
std004    7.5
std005    6.5
dtype: float64

In [27]:
my_ser_new = my_ser+0.5

In [28]:
my_ser_new

std001    9.4
std002    8.0
std003    8.1
std004    8.0
std005    7.0
dtype: float64

In [30]:
my_ser

std001    8.9
std002    7.5
std003    7.6
std004    7.5
std005    6.5
dtype: float64

In [29]:
my_ser.cumsum()

std001     8.9
std002    16.4
std003    24.0
std004    31.5
std005    38.0
dtype: float64

In [31]:
my_ser.describe()

count    5.0000
mean     7.6000
std      0.8544
min      6.5000
25%      7.5000
50%      7.5000
75%      7.6000
max      8.9000
dtype: float64

In [32]:
np.quantile(my_ser,0.25)

7.5

In [33]:
# co it nhat la 25% cac hoc sinh co diem trung binh <= 7.5
# co it nhat la 75% cac hoc sinh co diem trung binh >= 7.5

In [35]:
my_ser.median()

7.5

In [36]:
df = pd.DataFrame({'name':['Hai','Thuy','Ngan','Tu'], 'age':[35,21,32,17]})

In [37]:
df

   name  age
0   Hai   35
1  Thuy   21
2  Ngan   32
3    Tu   17

In [38]:
lst_1 = ['Hai','Thuy','Ngan','Tu']
lst_2 = [35,21,32,17]

In [39]:
df = pd.DataFrame({'name':lst_1, 'age':lst_2})

In [40]:
df

   name  age
0   Hai   35
1  Thuy   21
2  Ngan   32
3    Tu   17

In [41]:
ser_1 = pd.Series(['Hai','Thuy','Ngan','Tu'])
ser_2 = pd.Series([35,21,32,17])

In [42]:
df = pd.DataFrame({'name':ser_1, 'age':ser_2})

In [43]:
df

   name  age
0   Hai   35
1  Thuy   21
2  Ngan   32
3    Tu   17

In [44]:
type(df)

pandas.core.frame.DataFrame

In [45]:
ser_name = df['name']

In [46]:
type(ser_name)

pandas.core.series.Series

In [47]:
ser_name

0     Hai
1    Thuy
2    Ngan
3      Tu
Name: name, dtype: object

In [48]:
df = pd.DataFrame({'name':['Hai','Thuy','Ngan','Tu'], 'age':[35,21,32,17]})
df

   name  age
0   Hai   35
1  Thuy   21
2  Ngan   32
3    Tu   17

In [49]:
df['score'] = [10,7,8,9]

In [50]:
df

   name  age  score
0   Hai   35     10
1  Thuy   21      7
2  Ngan   32      8
3    Tu   17      9

In [51]:
df.columns

Index(['name', 'age', 'score'], dtype='object')

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int64
 2   score   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [53]:
df

   name  age  score
0   Hai   35     10
1  Thuy   21      7
2  Ngan   32      8
3    Tu   17      9

In [54]:
df.loc[2,'score'] = 8.5

In [55]:
df

   name  age  score
0   Hai   35   10.0
1  Thuy   21    7.0
2  Ngan   32    8.5
3    Tu   17    9.0

In [56]:
df['age']

0    35
1    21
2    32
3    17
Name: age, dtype: int64

In [57]:
df[['name','score']]

   name  score
0   Hai   10.0
1  Thuy    7.0
2  Ngan    8.5
3    Tu    9.0

In [58]:
df

   name  age  score
0   Hai   35   10.0
1  Thuy   21    7.0
2  Ngan   32    8.5
3    Tu   17    9.0

In [60]:
df[df['score']>8.5]

  name  age  score
0  Hai   35   10.0
3   Tu   17    9.0

In [61]:
df[df['score']>8.5]['name']

0    Hai
3     Tu
Name: name, dtype: object

In [63]:
df[df['score']>8.5][['name','age']]

  name  age
0  Hai   35
3   Tu   17

In [64]:
df['gioi tinh'] = ['nam','nu','nu','nam']

In [65]:
df

   name  age  score gioi tinh
0   Hai   35   10.0       nam
1  Thuy   21    7.0        nu
2  Ngan   32    8.5        nu
3    Tu   17    9.0       nam

In [66]:
df['name']

0     Hai
1    Thuy
2    Ngan
3      Tu
Name: name, dtype: object

In [67]:
df.name

0     Hai
1    Thuy
2    Ngan
3      Tu
Name: name, dtype: object

In [69]:
df['gioi tinh']

0    nam
1     nu
2     nu
3    nam
Name: gioi tinh, dtype: object

In [70]:
df = pd.DataFrame({'id':['001','003','007','010'], 'name':['Hai','Thuy','Ngan','Tu'], 'age':[35,21,32,17]})
df

    id  name  age
0  001   Hai   35
1  003  Thuy   21
2  007  Ngan   32
3  010    Tu   17

In [74]:
df = df.set_index('id')

In [75]:
df

     name  age
id
001   Hai   35
003  Thuy   21
007  Ngan   32
010    Tu   17

In [77]:
df = df.reset_index()

In [78]:
df

    id  name  age
0  001   Hai   35
1  003  Thuy   21
2  007  Ngan   32
3  010    Tu   17

In [79]:
df.set_index('id', inplace=True)

In [80]:
df

     name  age
id
001   Hai   35
003  Thuy   21
007  Ngan   32
010    Tu   17

In [81]:
df.reset_index(inplace=True)

In [82]:
df

    id  name  age
0  001   Hai   35
1  003  Thuy   21
2  007  Ngan   32
3  010    Tu   17

In [83]:
df.set_index('id', inplace=True)
df

     name  age
id
001   Hai   35
003  Thuy   21
007  Ngan   32
010    Tu   17

In [85]:
df.loc['007']

name    Ngan
age       32
Name: 007, dtype: object

In [87]:
df.reset_index(inplace=True)
df

    id  name  age
0  001   Hai   35
1  003  Thuy   21
2  007  Ngan   32
3  010    Tu   17

In [88]:
# sap age tang dan
df.sort_values(by='age')

    id  name  age
3  010    Tu   17
1  003  Thuy   21
2  007  Ngan   32
0  001   Hai   35

In [90]:
# sap age giam dan
df.sort_values(by='age', ascending=False)

    id  name  age
0  001   Hai   35
2  007  Ngan   32
1  003  Thuy   21
3  010    Tu   17

In [91]:
df = pd.DataFrame({'toan':[6.0,8.5,7.5], 'ly':[7.0,6.0,9.5], 'hoa':[5.0,8.0,9.0]})

In [92]:
df

   toan   ly  hoa
0   6.0  7.0  5.0
1   8.5  6.0  8.0
2   7.5  9.5  9.0

In [93]:
df.mean(axis=0)

toan    7.333333
ly      7.500000
hoa     7.333333
dtype: float64

In [94]:
df.mean(axis=1)

0    6.000000
1    7.500000
2    8.666667
dtype: float64

In [96]:
df['dtb'] = df.mean(axis=1)

In [97]:
df

   toan   ly  hoa       dtb
0   6.0  7.0  5.0  6.000000
1   8.5  6.0  8.0  7.500000
2   7.5  9.5  9.0  8.666667

In [98]:
df.describe()

           toan        ly       hoa       dtb
count  3.000000  3.000000  3.000000  3.000000
mean   7.333333  7.500000  7.333333  7.388889
std    1.258306  1.802776  2.081666  1.336801
min    6.000000  6.000000  5.000000  6.000000
25%    6.750000  6.500000  6.500000  6.750000
50%    7.500000  7.000000  8.000000  7.500000
75%    8.000000  8.250000  8.500000  8.083333
max    8.500000  9.500000  9.000000  8.666667